In [2]:
# Import Libraries

import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [4]:
dataset = pd.read_csv("../datasets/Data.csv")

In [7]:
dataset.head(10)
# Country, Age, Salaray: Independent Variables (원인)
# Purchased: Dependent Variables (결과)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
# Setting X and y

# X = dataset.iloc[rows, cols].values
# "0:": index 
# ":11": not include index 11
# ":-1": include everything not include last one
# "-1": only last one 
X = dataset.iloc[0:11, :-1].values
y = dataset.iloc[0:11, -1].values

In [14]:
# Checking missing values
# Check how many missing values per column
dataset.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [16]:
# Filling missing values with the mean
dataset['Age'] = dataset['Age'].fillna(dataset['Age'].mean())
dataset

   Country        Age   Salary Purchased
0   France  44.000000  72000.0        No
1    Spain  27.000000  48000.0       Yes
2  Germany  30.000000  54000.0        No
3    Spain  38.000000  61000.0        No
4  Germany  40.000000      NaN       Yes
5   France  35.000000  58000.0       Yes
6    Spain  38.777778  52000.0        No
7   France  48.000000  79000.0       Yes
8  Germany  50.000000  83000.0        No
9   France  37.000000  67000.0       Yes

In [18]:
# Filling missing values with the mean
dataset['Salary'] = dataset['Salary'].fillna(dataset['Salary'].mean())
dataset

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [19]:
# Checking missing values
# Check how many missing values per column
dataset.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [ ]:
# columns -> axis=1
# rows -> axix=0 (default)

In [ ]:
# One Hot Encoding